# Shell & prompt
brew "zsh"
brew "starship"
brew "thefuck"
brew "zoxide"

# Shell history
brew "fzf"
brew "navi"

# File tools
brew "eza"
brew "bat"
brew "bat-extras"
brew "yazi"
brew "fd"
brew "ripgrep"
brew "tree"
brew "trash"
brew "duf"

# Dev tools
brew "neovim"
brew "git"
brew "git-filter-repo"
brew "diff-so-fancy"
brew "lazygit"
brew "gh"
brew "just"
brew "jq"
brew "glow"
brew "curl"
brew "wget"
brew "rsync"

# Security & secrets
brew "age"
brew "sops"
brew "gnupg"
brew "detect-secrets"

# chezmoi (bootstraps itself on next machine)
brew "chezmoi"

# Infra / cloud
brew "ansible"
brew "opentofu"
brew "kubernetes-cli"
brew "tailscale"

# Networking & diagnostics
brew "mtr"
brew "nmap"
brew "iperf3"
brew "speedtest-cli"
brew "curlie"

# Misc CLI
brew "fastfetch"
brew "btop"
brew "tmux"
brew "mas"
brew "opencode"

# Apps (casks)
cask "ghostty"
cask "orbstack"
cask "1password"
cask "1password-cli"
cask "raycast"
cask "linearmouse"
cask "alt-tab"
cask "stats"
cask "figma"
cask "drawio"
cask "postman"
cask "cyberduck"
cask "localsend"
cask "keka"
cask "discord"
cask "whatsapp"
cask "wireshark-app"
cask "thaw"
cask "basictex"
cask "cmux"
cask "font-symbols-only-nerd-font"
